# Создайте переменную name и присвойте ей значение вашего имени (строка).
# Выведите значение переменной name на экран.
# Создайте переменную age и присвойте ей значение вашего возраста (целое число).
# Выведите значение переменной age на экран.
# Перезапишите в age текущее значение переменной age + новое.
# Выведите измененное значение переменной age на экран.
# Создайте переменную is_student и присвойте ей значение True (логическое значение).
# Выведите значение переменной is_student на экран.
name = "ReviverVLM"
age = 29
age = age + 1
is_student = True
print("Name: " + name)
print("Age: " + str(age))
print("New_age: " + str(age))
print("Is student: " + str(is_student))
